{
  "Title": "Three Body Problem",
  "Description": "In this simulation we take a look at an example of the three body problem! This is fascinating problem within physics that can teach us an awful lot about how nature deals with complex multi-body systems. During this lesson we will discuss one of the most popular solutions to the three body problem which resembles a figure of eight!",
  "ThumbnailPath": "../../../savedata/thumbnails/three_body_problem.png",
  "IsLesson": true,
  "DefaultTimestep": 200,
  "VectorMultiplier": 75,
  "Bodies": [
    {
      "Name": "Body 1",
      "Position": { "X": 436.5, "Y": -109.39 },
      "Velocity": { "X": 0.466203685, "Y": 0.43236573 },
      "Mass": 60000000.0,
      "Diameter": 25,
      "Color": "#ff6666"
    },
    {
      "Name": "Body 2",
      "Position": { "X": -436.5, "Y": 109.39 },
      "Velocity": { "X": 0.466203685, "Y": 0.43236573 },
      "Mass": 60000000.0,
      "Diameter": 25,
      "Color": "#66ff66"
    },
    {
      "Name": "Body 3",
      "Position": { "X": 0, "Y": 0 },
      "Velocity": { "X": -0.93240737, "Y": -0.86473146 },
      "Mass": 60000000.0,
      "Diameter": 25,
      "Color": "#6666ff"
    }
  ],
  "LessonPages": [
    {
      "Text": "The three-body problem provides a fascinating example of orbital mechanics. The problem arises when trying to come up with a set of velocities and positions for three bodies of equal mass that results in a stable, non-chaotic system. \n\nThe simulation here is a crude-replica of the well-known \"figure of eight\" solution to the three-body problem.",
      "HighlightWidget": "",
      "RestrictWidgets": ["create_body", "edit_mode"]
    },
    {
      "Text": "To better visualize this set the trail length to the maximum setting of '2000'. Additionally, use the shortcut Ctrl-O to toggle the future projected orbits of the three bodies. Note the rough outline of the orbital trails matches that of a figure of eight. Of course, even this system will become unstable over time, but for the sake of fun let's accelerate the process. \n\nSee the next page for instructions.",
      "HighlightWidget": "",
      "RestrictWidgets": ["create_body", "edit_mode"]
    },
    {
      "Text": "Step #1: pause the simulation via the button or the shortcut Ctrl-P. \nStep #2: activate 'Edit Mode' (the appropriate button is highlighted).\nStep #3: select 'Body 1'.\nStep #4: select 'Edit Body Properties'.\nStep #5: change the mass from 60,000,000 to 80,000,000.\nStep #6: click 'Confirm'.\nStep #7: resume the simulation.",
      "HighlightWidget": "edit_mode",
      "RestrictWidgets": ["create_body"]
    },
    {
      "Text": "Behold as the once delicate arrangement of three bodies has begun to destabilize! \n\nBut, you may be wondering if there are any natural examples of the three body problem: there are, but perhaps not in the way you expect. Rather than finely tuned, deterministic systems, nature solves the three body problem by well, cheating.\n\n(see the next page)",
      "HighlightWidget": "",
      "RestrictWidgets": ["create_body", "edit_mode"]
    },
    {
      "Text": "Essentially, in multi-star systems it is common to find a single star orbiting around two other stars that are much closer together. Due to their relative proximity, these two close stars form a common barycentre which the third star orbits as if it were a single body.",
      "HighlightWidget": "",
      "RestrictWidgets": ["create_body", "edit_mode"]
    },
    {
      "Text": "Here are some great resources to enhance your learning further:\n\nhttps://en.wikipedia.org/wiki/Three-body_problem\nhttps://en.wikipedia.org/wiki/Binary_star\nhttps://en.wikipedia.org/wiki/Star_system\n\nClick 'Restart Simulation' to try again if anything confused you!",
      "HighlightWidget": "",
      "RestrictWidgets": ["create_body", "edit_mode"]
    }
  ]
}